Table of Contents
 Interface IIdeaSpan
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Span allows specifying haunched member.
Both cross-sect
public interface IIdeaSpan : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 EndCrossSection
Cross-section at the end position of the span.
IIdeaCrossSection EndCrossSection { get; }
Property Value
IIdeaCrossSection
 EndPosition
Relative position on the member where the span ends.
double EndPosition { get; }
Property Value
double
 StartCrossSection
Cross-section at the start position of the span. Must not be null.
IIdeaCrossSection StartCrossSection { get; }
Property Value
IIdeaCrossSection
 StartPosition
Relative position on the member where the span starts.
double StartPosition { get; }
Property Value
double
 Edit this page